"""
Задача 1: Найдите сумму цифр трехзначного числа.
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
"""


def sum(i):
    a = 0
    while i > 0:
        a = a + i % 10
        i = i // 10
    return a


print(sum(int(input())))
